soldernerd/PIC18_USB_Bootloader/fat16.c

#include <stdint.h>
#include <xc.h>
#include "string.h"
#include "os.h"
#include "fat16.h"
#include "flash.h"

static uint8_t _get_mbr(uint16_t idx);
static uint8_t _get_fbr(uint16_t idx);
static uint8_t _get_fat(uint16_t idx);
static uint8_t _get_root(uint16_t idx);
static uint16_t _get_time(void);
static uint16_t _get_date(void);
static void _update_modified_time(rootEntry_t *root);
static uint8_t _get_available_root_entry(void);
static uint16_t _get_empty_cluster(uint16_t first_cluster);
static void _write_fat(uint16_t cluster, uint16_t value);
static uint16_t _read_fat(uint16_t cluster);
static void _write_root(uint8_t slot, rootEntry_t *data);
static void _delete_root(uint8_t slot);
static uint16_t _get_first_cluster(uint8_t slot);
static uint32_t _get_file_size(uint8_t slot);
static void _write_file_size(uint8_t file_number, uint32_t new_file_size);
static uint16_t _sector_from_cluster(uint16_t fat_cluster);

uint8_t buffer[512];

static uint16_t _get_time(void)
{
    uint16_t time;
//    uint8_t hours = rtcc_get_hours_decimal();
//    uint8_t minutes = rtcc_get_minutes_decimal();
//    uint8_t seconds = rtcc_get_seconds_decimal();
//    time = ((hours&0b11111) << 11);
//    time |= ((minutes&0b111111) << 5);
//    time |= ((seconds>>1)&0b11111);
    return time;
};

static uint16_t _get_date(void)
{
    uint16_t date;
//    uint8_t year = rtcc_get_year_decimal();
//    uint8_t month = rtcc_get_month_decimal();
//    uint8_t day = rtcc_get_day_decimal();
//    date = (((year+20)&0b1111111) << 9);
//    date |= ((month&0b1111) << 5);
//    date |= (day&0b11111);
    return date;
}

static void _update_modified_time(rootEntry_t *root)
{
    root->modifiedDate = _get_date();
    root->modifiedTime = _get_time();
}

static uint8_t _root_is_available(uint8_t file_number)
{
    uint16_t root_sector;
    uint16_t offset;
    uint8_t first_byte;
    
    //Sanity check
    //Make sure we have a valid file number
    if(file_number>=FBR_ROOT_ENTRIES)
    {
        //Indicate that root entry is not available
        return 0;
    }
    
    //Find position of root entry
    root_sector = (file_number >> 4) + ROOT_FIRST_SECTOR;
    offset = (file_number & 0b1111);
    offset <<= 5;
    
    //Read the first character of the root entry
    flash_partial_read(root_sector, offset, 1, &first_byte);   
    
    //Check the value of the first byte and return accordingly
    if((first_byte==0x00) || (first_byte==0xE5))
    {
        //Root entry is available
        return 1;
    }
    else
    {
        //Root entry is not available
        return 0;
    }
}

static uint8_t _get_available_root_entry(void)
{
    uint8_t file_number;
    for(file_number=0; file_number<FBR_ROOT_ENTRIES; ++file_number)
    {
        if(_root_is_available(file_number))
        {
            return file_number;
        }
    }
    return 0xFF; //Indicating an error, i.e there are no available slots
}

static uint16_t _get_empty_cluster(uint16_t first_cluster)
{
    uint16_t cluster;
    uint16_t fat_sector;
    uint16_t offset;
    uint16_t value;
    
    //Start at 2, first two positions are reserved
    for(cluster=first_cluster; cluster<(DATA_NUMBER_OF_SECTORS+2); ++cluster)
    {
        fat_sector = cluster>>8; 
        fat_sector += FAT_FIRST_SECTOR;
        offset = cluster & 0xFF;
        offset <<= 1;
        flash_partial_read(fat_sector, offset, 2, &value);
        if(value==0x0000)
        {
            return cluster;
        }
    }
    return 0x0000; //Indicating that there are no free clusters
}

uint16_t fat_get_empty_clusters(uint16_t maximum)
{
    uint16_t empty_clusters = 0;
    uint16_t cluster;
    uint16_t fat_sector;
    uint16_t offset;
    uint16_t value;
    
    //Start at 2, first two positions are reserved
    for(cluster=2; cluster<(DATA_NUMBER_OF_SECTORS+2); ++cluster)
    {
        fat_sector = cluster>>8; 
        fat_sector += FAT_FIRST_SECTOR;
        offset = cluster & 0xFF;
        offset <<= 1;
        flash_partial_read(fat_sector, offset, 2, &value);
        if(value==0x0000)
        {
            ++empty_clusters;
            if(empty_clusters==maximum)
            {
                return empty_clusters;
            }
        }
    }
    return empty_clusters;
}

static void _write_fat(uint16_t cluster, uint16_t value)
{
    uint16_t fat_sector;
    uint16_t offset;
    fat_sector = cluster>>8; 
    fat_sector += FAT_FIRST_SECTOR;
    offset = cluster & 0xFF;
    offset <<= 1;
    flash_partial_write(fat_sector, offset, 2, &value);
}

static uint16_t _read_fat(uint16_t cluster)
{
    uint16_t fat_sector;
    uint16_t offset;
    uint16_t value;
    fat_sector = cluster>>8; 
    fat_sector += FAT_FIRST_SECTOR;
    offset = cluster & 0xFF;
    offset <<= 1;
    flash_partial_read(fat_sector, offset, 2, &value);
    return value;
}

static void _write_root(uint8_t slot, rootEntry_t *data)
{
    uint16_t root_sector;
    uint16_t offset;
    root_sector = (slot >> 4) + ROOT_FIRST_SECTOR;
    offset = (slot & 0b1111);
    offset <<= 5;
    flash_partial_write(root_sector, offset, 32, data);
}

static void _delete_root(uint8_t slot)
{
    uint16_t root_sector;
    uint16_t offset;
    uint8_t deleted_value;
    
    root_sector = (slot >> 4) + ROOT_FIRST_SECTOR;
    offset = (slot & 0b1111);
    offset <<= 5;
    deleted_value = 0xE5;
    flash_partial_write(root_sector, offset, 1, &deleted_value);
}

static uint16_t _get_first_cluster(uint8_t slot)
{
    uint16_t sector;
    uint16_t offset;
    uint16_t first_cluster;
    sector = slot >> 4;
    sector += ROOT_FIRST_SECTOR;
    offset = slot & 0b1111;
    offset <<= 5;
    offset += 26;
    flash_partial_read(sector, offset, 2, &first_cluster);
    return first_cluster;
}

static uint32_t _get_file_size(uint8_t slot)
{
    uint16_t sector;
    uint16_t offset;
    uint32_t file_size;
    sector = slot >> 4;
    sector += ROOT_FIRST_SECTOR;
    offset = slot & 0b1111;
    offset <<= 5;
    offset += 28;
//    flash_partial_write(22, 0, 1, &slot);
//    flash_partial_write(22, 1, 2, &sector);
//    flash_partial_write(22, 3, 2, &offset);
    flash_partial_read(sector, offset, 4, &file_size);
    //file_size = 0x12345678;
//    flash_partial_write(22, 5, 4, &file_size);
    return file_size;
}

static void _write_file_size(uint8_t file_number, uint32_t new_file_size)
{
    uint16_t sector;
    uint16_t offset;
    sector = file_number >> 4;
    sector += ROOT_FIRST_SECTOR;
    offset = file_number & 0b1111;
    offset <<= 5;
    offset += 28;
    flash_partial_write(sector, offset, 4, &new_file_size);
}

