soldernerd/PIC18_USB_Bootloader/fat16.c
uint8_t fat_find_file(char *name, char *extension)
{
    uint8_t slot;
    uint16_t sector;
    uint16_t offset;
    uint8_t buffer[11];
    slot = 0;
    for(sector = ROOT_FIRST_SECTOR; sector <= ROOT_LAST_SECTOR; ++sector)
    {
        for(offset = 0; offset<512; offset += 32)
        {
           flash_partial_read(sector, offset, 11, &buffer);
           if(buffer[0]==0x00)
           {
               //There are no valid entries after a 0x00 entry
               //Indicate that there is no such file
               return 0xFF; 
           }
           else if(buffer[0]==0xE5)
           {
               //This file has been deleted
               //But there might be valid entries after this
               //Just do nothing
           }
           else
           {
               //This is a valid entry, check if name matches
               if(strncmp(name, &buffer[0], 8) == 0)
               {
                   //Name matches so check if extension matches as well
                   if(strncmp(extension, &buffer[8], 3) == 0)
                   {
                       //Both name and extension match
                       //We have found the file we're looking for
                       return slot;
                   }
               }
           }
           ++slot;
        }
    }
    return 0xFF; //Indicating an error, i.e file not found  
}

uint32_t fat_get_file_size(uint8_t file_number)
{
    uint16_t sector;
    uint16_t offset;
    uint32_t file_size;
    sector = file_number >> 4;
    sector += ROOT_FIRST_SECTOR;
    offset = file_number;
    offset <<= 5;
    offset &= 0b111111111;
    offset += 28;
    flash_partial_read(sector, offset, 4, &file_size);
    return file_size;
}

uint8_t fat_create_file(char *name, char *extension, uint32_t size)
{
    uint8_t root_slot;
    rootEntry_t root_entry;
    uint16_t cluster;
    uint16_t next_cluster;
    uint16_t number_of_clusters;
    uint16_t cluster_count;
    
    //Check if a file with this name already exists in root
    //Return an error if the file is found
    if(fat_find_file(name, extension) != 0xFF)
    {
        //We found a file with this name and extension
        //Return an error
        return 0xFF;
    }
    
    //Find an available root slot
    //Return an error if no slot is available
    root_slot = _get_available_root_entry();
    if(root_slot == 0xFF)
    {
        //There is no empty slot
        //Return an error
        return 0xFE;
    }
    
    //Check if there's enough space for the desired file size
    number_of_clusters = (size>>9) + 1;
    if(fat_get_empty_clusters(number_of_clusters) != number_of_clusters)
    {
        //There is not enough space on the drive
        //Return an error
        return 0xFD;
    }
    
    //Obtain the first cluster
    cluster = _get_empty_cluster(2);
    
    //Prepare root entry
    memcpy(root_entry.fileName, name, 8);
    memcpy(root_entry.fileExtension, extension, 3);
    root_entry.attributes = 0x00;
    root_entry.reserved1 = 0x00;
    root_entry.secondFractions = 0x00;
    root_entry.createdTime = _get_time();
    root_entry.createdDate = _get_date();
    root_entry.lastAccessDate = root_entry.createdDate;
    root_entry.reserved2 = 0x00;
    root_entry.modifiedTime = root_entry.createdTime;
    root_entry.modifiedDate = root_entry.createdDate;
    root_entry.firstCluster = cluster;
    root_entry.fileSize = size;
    
    //Write root entry
    _write_root(root_slot, &root_entry);
    
    //Reserve first cluster(s)
    //This code works but is inefficient since it reserves clusters one a the time
    //That's probably fine since we rarely if ever need to reserve more than one
    for(cluster_count=1; cluster_count<=number_of_clusters; ++cluster_count)
    {
        
        if(cluster_count==number_of_clusters)
        {
            //This is the last cluster we need to reserve
            _write_fat(cluster, 0xFFFF);
        }
        else
        {
            //There are more clusters to be reserved
            next_cluster = _get_empty_cluster(cluster+1);
            //Reserve this cluster and place a link to the next cluster
            _write_fat(cluster, next_cluster);
            //Prepare for the next loop
            cluster = next_cluster;
        }
    }
    return root_slot;
}

void fat_delete_file(uint8_t file_number)
{
    uint16_t first_cluster;
    uint16_t next_cluster;
    
    //Make sure we have a valid file number
    if(file_number>=FBR_ROOT_ENTRIES)
    {
        //Nothing to be done
        return;
    }
    
    //Check if file is in use
    if(_root_is_available(file_number))
    {
        //Nothing to be done
        return;
    }
    
    //Get number of first cluster, i.e where to start
    first_cluster = _get_first_cluster(file_number);
    //The last cluster of a chain contains a value above 0xFFF0, usually 0xFFFF
    //Loop and delete until we reach that final cluster
    while(1)
    {
        //Read value of current cluster
        //The value points to the next cluster
        next_cluster = _read_fat(first_cluster);
        //An extra checks just in case
//        if(next_cluster<2)
//        {
//            break;
//        }
        //Mark the current cluster as re-usable
        _write_fat(first_cluster, 0x0000);
        //If that cluster contained 0xFFFF (or similar) before, we're done
        if(next_cluster>0xFFF0)
        {
            break;
        }
        //We're not done, start again
        else
        {
            first_cluster = next_cluster;
        }
    }
    
    //Now all the clusters are marked as re-usable
    //But the file entry in the root still exists
    _delete_root(file_number);
}

static uint16_t _sector_from_cluster(uint16_t fat_cluster)
{
    return fat_cluster + DATA_FIRST_SECTOR - 2;
}

uint8_t fat_append_to_file(uint8_t file_number, uint16_t number_of_bytes, uint8_t *data)
{
    rootEntry_t root;
    uint32_t file_size;
    uint16_t fat_cluster;
    uint16_t new_cluster;
    uint32_t position;
    uint16_t offset;
    uint16_t sector;
    uint16_t length;
    
    //Make sure we have a valid file number
    if(file_number>=FBR_ROOT_ENTRIES)
    {
        //Return an error
        return 0xFF;
    }
    
