soldernerd/PIC18_USB_Bootloader/fat16.c
    //Check if file is in use
    if(_root_is_available(file_number))
    {
        //Return an error
        return 0xFE;
    }

    //Collect data from the root entry
    fat_get_file_information(file_number, &root);
    file_size = root.fileSize;
    fat_cluster = root.firstCluster;
    
    //First, find right cluster, sector and offset
    position = 0;
    while((file_size-position)>512)
    {
        fat_cluster = _read_fat(fat_cluster);
        position += 512;
    }
    
    //Calculate offset
    offset = file_size - position;
    
    //Now we know where to start writing data
    position = 0;
    while(position < number_of_bytes)
    {
        //Do we need another cluster first?
        if(offset==512)
        {
            //Need to add a new cluster
            //Find an unused cluster
            new_cluster = _get_empty_cluster(0x0000);
            //Update the last cluster to point to that new cluster
            _write_fat(fat_cluster, new_cluster);
            //Mark the new cluster as used
            _write_fat(new_cluster, 0xFFFF);
            //Reset fat_cluster and offset
            fat_cluster = new_cluster;
            offset = 0;
        }
        
        //Get physical flash sector from logical cluster address
        sector = _sector_from_cluster(fat_cluster);
        
        //How much data can we/should we write to the current cluster?
        length = 512 - offset;
        if(length>number_of_bytes)
        {
            length = number_of_bytes;
        }
        
        //Write that data
        flash_partial_write(sector, offset, length, &data[position]);
        
        //Update position and offset
        position += length;
        offset += length;
    }
    
    //Now all the data has been written
    //But we still need to update the file size and modified date/time in the root entry
    root.fileSize += number_of_bytes;
    _update_modified_time(&root);
    _write_root(file_number, &root);

    //Report success
    return 0x00;
}

void fat_rename_file(uint8_t file_number, char *name, char *extension)
{
    rootEntry_t root;
    uint8_t cntr;
    
    //Obtain a copy of root entry
    fat_get_file_information(file_number, &root);
    
    //Change file name
    for(cntr=0; cntr<8; ++cntr)
    {
        root.fileName[cntr] = name[cntr];
    }
    
    //Change extension
    for(cntr=0; cntr<3; ++cntr)
    {
        root.fileExtension[cntr] = extension[cntr];
    }
    
    _write_root(file_number, &root);
}

uint8_t fat_read_from_file(uint8_t file_number, uint32_t start_byte, uint32_t length, uint8_t *data)
{
    rootEntry_t root;
    uint16_t cluster;
    uint16_t cluster_number;
    
    //Read root entry
    fat_get_file_information(file_number, &root);
    cluster = root.firstCluster;
    cluster_number = 0;
    
    //Check file size
    if(start_byte+length > root.fileSize)
    {
        //Indicate an error
        return 0xFF;
    }
    
    //Now we know where to start, call fast function
    return fat_read_from_file_fast(start_byte, length, data, &cluster, &cluster_number);
}

uint8_t fat_read_from_file_fast(uint32_t start_byte, uint32_t length, uint8_t *data, uint16_t *cluster, uint16_t *cluster_number)
{
    uint32_t position;
    uint16_t offset;
    uint16_t sector;
    uint16_t read_length;
    uint16_t working_cluster;
    
    //First, find right cluster, sector and offset
    position = (*cluster_number);
    position *= 512;
    if(position > start_byte)
    {
        //Indicate an error
        return 0xFF;
    }
    while((start_byte-position) >= 512)
    {
        (*cluster) = _read_fat((*cluster));
        ++(*cluster_number);
        position += 512;
    }
    
    //Only use working cluster from now on
    //Do no longer update pointers *cluster and *cluster_number
    working_cluster = (*cluster);
    
    //Calculate offset
    offset = start_byte - position;

    //Now we know where to start reading data
    position = 0;
    while(position < length)
    {
        //Do we need another cluster first?
        if(offset==512)
        {
            //Need to get the next cluster cluster
            working_cluster  = _read_fat(working_cluster);
            offset = 0;
        }
        
        //Get physical flash sector from logical cluster address
        sector = _sector_from_cluster(working_cluster);
        
        //How much data can we/should we write to the current cluster?
        read_length = 512 - offset; //Maximum we can read from this cluster
        if(read_length > (length-position))
        {
            //Just read all remaining bytes
            read_length = length - position;
        }
        
        //Read that data
        flash_partial_read(sector, offset, read_length, &data[position]);
        
        //Update position and offset
        position += read_length;
        offset += read_length;
    }
    
    //Indicate success
    return 0x00;
}

static uint8_t _get_mbr(uint16_t idx)
{
	switch (idx)
	{
		case 0x1BE:
			return MRB_PARTITION_STATUS;
		case 0x1BF:
            return MBR_PARTITION_START_HEAD;
		case 0x1C0:
            return MBR_PARTITION_START_SECTOR;
		case 0x1C1:
            return MBR_PARTITION_START_CYLINDER;
		case 0x1C2:
			return MBR_PARTITION_TYPE;
		case 0x1C3:
            return MBR_PARTITION_END_HEAD;
		case 0x1C4:
            return MBR_PARTITION_END_SECTOR;
		case 0x1C5:
			return MBR_PARTITION_END_CYLINDER;
		case 0x1C6:
            return LOW_BYTE(LOW_WORD(((uint32_t)MBR_FIRST_PARTITION_SECTOR)));
		case 0x1C7:
			return HIGH_BYTE(LOW_WORD(((uint32_t)MBR_FIRST_PARTITION_SECTOR)));
		case 0x1C8:
			return LOW_BYTE(HIGH_WORD(((uint32_t)MBR_FIRST_PARTITION_SECTOR)));
		case 0x1C9:
            return HIGH_BYTE(HIGH_WORD(((uint32_t)MBR_FIRST_PARTITION_SECTOR)));
		case 0x1CA:
			return LOW_BYTE(LOW_WORD(((uint32_t)MBR_PARTITION_SIZE)));
		case 0x1CB:
			return HIGH_BYTE(LOW_WORD(((uint32_t)MBR_PARTITION_SIZE)));
		case 0x1CC:
			return LOW_BYTE(HIGH_WORD(((uint32_t)MBR_PARTITION_SIZE)));
		case 0x1CD:
			return HIGH_BYTE(HIGH_WORD(((uint32_t)MBR_PARTITION_SIZE)));
		case 0x1FE:
			return HIGH_BYTE((uint16_t)MBR_SIGNATURE);
		case 0x1FF:
			return LOW_BYTE((uint16_t)MBR_SIGNATURE);
		default:
			return 0X00;
	}
}

static uint8_t _get_fbr(uint16_t idx)
{
	switch (idx)
	{
        case 0x00:
            return 0xEB;
        case 0x01:
            return 0x3C;
        case 0x02:
            return 0x90;
		case 0x03:
			return FBR_OEM_IDENTIFIER[0];
		case 0x04:
			return FBR_OEM_IDENTIFIER[1];
		case 0x05:
			return FBR_OEM_IDENTIFIER[2];
		case 0x06:
			return FBR_OEM_IDENTIFIER[3];
		case 0x07:
			return FBR_OEM_IDENTIFIER[4];
		case 0x08:
			return FBR_OEM_IDENTIFIER[5];
		case 0x09:
			return FBR_OEM_IDENTIFIER[6];
		case 0x0A:
			return FBR_OEM_IDENTIFIER[7];
		case 0x0B:
			return LOW_BYTE(((uint16_t)FBR_BYTES_PER_SECTOR));
		case 0x0C:
			return HIGH_BYTE(((uint16_t)FBR_BYTES_PER_SECTOR));
		case 0x0D:
			return FBR_SECTORS_PER_CLUSTER;
		case 0x0E:
            return LOW_BYTE(((uint16_t)FBR_RESERVED_SECTORS));
		case 0x0F:
            return HIGH_BYTE(((uint16_t)FBR_RESERVED_SECTORS));
		case 0x10:
			return FBR_NUMBER_OF_FATS;
		case 0x11:
            return LOW_BYTE(((uint16_t)FBR_ROOT_ENTRIES));
		case 0x12:
            return HIGH_BYTE(((uint16_t)FBR_ROOT_ENTRIES));
		case 0x13:
            return LOW_BYTE(((uint16_t)FBR_NUMBER_OF_SECTORS));
		case 0x14:
            return HIGH_BYTE(((uint16_t)FBR_NUMBER_OF_SECTORS));
		case 0x15:
			return FBR_MEDIA_DESCRIPTOR;
		case 0x16:
            return LOW_BYTE(((uint16_t)FBR_SECTORS_PER_FAT));
		case 0x17:
            return HIGH_BYTE(((uint16_t)FBR_SECTORS_PER_FAT));
		case 0x18:
            return LOW_BYTE(((uint16_t)FBR_SECTORS_PER_HEAD));
		case 0x19:
            return HIGH_BYTE(((uint16_t)FBR_SECTORS_PER_HEAD));
		case 0x1A:
            return LOW_BYTE(((uint16_t)FBR_HEADS_PER_CYLINDER));
		case 0x1B:
            return HIGH_BYTE(((uint16_t)FBR_HEADS_PER_CYLINDER));
		case 0x1C:
            return LOW_BYTE(LOW_WORD(((uint32_t)FBR_HIDDEN_SECTORS)));
		case 0x1D:
            return HIGH_BYTE(LOW_WORD(((uint32_t)FBR_HIDDEN_SECTORS)));
		case 0x1E:
            return LOW_BYTE(HIGH_WORD(((uint32_t)FBR_HIDDEN_SECTORS)));
		case 0x1F:
            return HIGH_BYTE(HIGH_WORD(((uint32_t)FBR_HIDDEN_SECTORS)));
		case 0x28:
            return LOW_BYTE(((uint16_t)FBR_EXT_FLAGS));
		case 0x29:
            return HIGH_BYTE(((uint16_t)FBR_EXT_FLAGS));
		case 0x2C:
            return LOW_BYTE(LOW_WORD(((uint32_t)FBR_ROOT_DIRECTORY_START)));
		case 0x2D:
            return HIGH_BYTE(LOW_WORD(((uint32_t)FBR_ROOT_DIRECTORY_START)));
		case 0x2E:
            LOW_BYTE(HIGH_WORD(((uint32_t)FBR_ROOT_DIRECTORY_START)));
		case 0x2F:
            return HIGH_BYTE(HIGH_WORD(((uint32_t)FBR_ROOT_DIRECTORY_START)));
        case 0x36:
            return 'F';
        case 0x37:
            return 'A';
        case 0x38:
            return 'T';
        case 0x39:
            return '1';
        case 0x3A:
            return '6';
        case 0x3B:
            return ' ';
        case 0x3C:
            return ' ';
        case 0x3D:
            return ' ';
		case 0x1FE:
            return HIGH_BYTE(((uint16_t)FBR_SIGNATURE));
		case 0x1FF:
            return LOW_BYTE(((uint16_t)FBR_SIGNATURE));
		default:
			return 0X00;
	}
}

static uint8_t _get_fat(uint16_t idx)
{
	switch (idx)
	{
        //Bytes 0-4 are reserved
		case 0x00:
			return 0xF8;
		case 0x01:
			return 0xFF;
		case 0x02:
			return 0xFF;
		case 0x03:
			return 0xFF;
        //Bytes 4 & 5 = 0xFFFF. So there is 1 file occupying a single cluster
		case 0x04:
			return 0xFF;
		case 0x05:
			return 0xFF;
		default:
			return 0X00;
	}
}

