soldernerd/PIC18_USB_Bootloader/fat16.c
static uint8_t _get_root(uint16_t idx)
{
	if (idx < 0x20) // Volume information
	{
		if (idx < 11)
		{
			return ROOT_DRIVE_NAME[idx];
		}
        if(idx==11)
        {
            return 0x08;
        }
	}
	if (idx < 0x40) // Example file
	{
		idx -= 0x20;
		if (idx < 0+8)
		{
			return ROOT_FILE_NAME[idx];
		}
		if (idx < 11)
		{
			return ROOT_FILE_EXTENSION[idx-8];
		}
		switch (idx)
		{
            case 11:
                return 0x20;
            case 0x0D:
                return 0x06;
            case 0x0E:
                return 0x28;
            case 0x0F:
                return 0x78;
            case 0x10:
                return 0xDE;
            case 0x11:
                return 0x38;
            case 0x12:
                return 0x5F;
            case 0x13:
                return 0x4B;
            case 0x14:
                return 0x00;
            case 0x15:
                return 0x00;
            case 0x16:
                return 0x04;
            case 0x17:
                return 0x77;
            case 0x18:
                return 0xDE;
            case 0x19:
                return 0x38;
            case 26:
                return LOW_BYTE(((uint16_t)ROOT_FILE_FIRST_CLUSTER));
            case 27:
                return HIGH_BYTE(((uint16_t)ROOT_FILE_FIRST_CLUSTER));
			case 28:
                return LOW_BYTE(LOW_WORD(((uint32_t)ROOT_FILE_SIZE)));
				//return ROOT_FILE_SIZE & 0XFF;
			case 29:
                return HIGH_BYTE(LOW_WORD(((uint32_t)ROOT_FILE_SIZE)));
				//return (ROOT_FILE_SIZE >> 8) & 0XFF;
			case 30:
                return LOW_BYTE(HIGH_WORD(((uint32_t)ROOT_FILE_SIZE)));
				//return (ROOT_FILE_SIZE >> 16) & 0XFF;
			case 31:
                return HIGH_BYTE(HIGH_WORD(((uint32_t)ROOT_FILE_SIZE)));
				//return (ROOT_FILE_SIZE >> 24) & 0XFF;
			default:
				return 0x00;
		}
	}
	return 0X00;
}

static uint8_t _get_data(uint16_t idx)
{
	if (idx < ROOT_FILE_SIZE) // Dummy file
	{
        return ROOT_FILE_CONTENT[idx];
	}
	return 0X00;
}

formatStatus_t fat_get_format_status(void)
{
    uint16_t cntr;
    
    //Check Master Boot Record (sector 0)
    flash_page_read(0, buffer);
    for(cntr=0; cntr<512; ++cntr)
    {
        if(buffer[cntr] != _get_mbr(cntr))
        {
            return DRIVE_NOT_FORMATED;
        }
    }
    
    //Check First Boot Record (sector 1)
    flash_page_read(1, buffer);
    for(cntr=0; cntr<512; ++cntr)
    {
        if(buffer[cntr] != _get_fbr(cntr))
        {
            return DRIVE_NOT_FORMATED;
        }
    }
    
    //If we get here, the drive is formated
    return DRIVE_FORMATED;
}

void fat_format(void)
{
    uint16_t cntr;
    
    //Write MBR
    for(cntr=0; cntr<512; ++cntr)
    {
        buffer[cntr] = _get_mbr(cntr);
    }
    flash_page_write(MBR_SECTOR, buffer);
    
    //Write FBR
    for(cntr=0; cntr<512; ++cntr)
    {
        buffer[cntr] = _get_fbr(cntr);
    }
    flash_page_write(1, buffer);
    
    //Write first FAT sector
    for(cntr=0; cntr<512; ++cntr)
    {
        buffer[cntr] = _get_fat(cntr);
    }
    flash_page_write(FAT_FIRST_SECTOR, buffer);
    
    //Fill remaining FAT sectors (all zeros)
    for(cntr=0; cntr<512; ++cntr)
    {
        buffer[cntr] = 0x00;
    }
    for(cntr=FAT_FIRST_SECTOR+1; cntr<=FAT_LAST_SECTOR; ++cntr)
    {
        flash_page_write(cntr, buffer);
    }
    
    //Write first root sector
    for(cntr=0; cntr<512; ++cntr)
    {
        buffer[cntr] = _get_root(cntr);
    }
    flash_page_write(ROOT_FIRST_SECTOR, buffer);
    
    //Fill remaining root sectors (all zeros)
    for(cntr=0; cntr<512; ++cntr)
    {
        buffer[cntr] = 0x00;
    }
    for(cntr=ROOT_FIRST_SECTOR+1; cntr<=ROOT_LAST_SECTOR; ++cntr)
    {
        flash_page_write(cntr, buffer);
    }
    
    //Write Data of hello world file
    for(cntr=0; cntr<512; ++cntr)
    {
        buffer[cntr] = _get_data(cntr);
    }
    flash_page_write(DATA_FIRST_SECTOR, buffer);
}

void fat_init(void)
{
    //Format flash if necessary
    if(fat_get_format_status()==DRIVE_NOT_FORMATED)
    {
        fat_format();
    }
}

uint8_t fat_get_file_information(uint8_t file_number, rootEntry_t *data)
{
    uint16_t root_sector;
    uint16_t offset;
    
    if(file_number>=FBR_ROOT_ENTRIES)
    {
        //Error: invalid file_number
        return 0x01;
    }
    if(_root_is_available(file_number))
    {
        //Error: there is no file in that location
        return 0x02;
    }

    root_sector = (file_number >> 4) + ROOT_FIRST_SECTOR;
    offset = (file_number & 0b1111);
    offset <<= 5;
    flash_partial_read(root_sector, offset, 32, data);
    
    //Indicate success
    return 0x00;
}